from classes import Apparatus


class CT3(Apparatus):
    '''Класс для описания трасформатора тока с 3 обмотками'''
    model = 'Трансформатор тока с тремя вторичными обмотками'
    trans = (('i11', '1И1'),
             ('i12', '1И2'),
             ('i21', '2И1'),
             ('i22', '2И2'),
             ('i31', '3И1'),
             ('i32', '3И2'))

class CT1(Apparatus):
    '''Класс для описания трасформатора тока с 3 обмотками'''
    model = 'Трансформатор тока нулевой последовательности'
    trans = (('i1', 'И1'),
             ('i2', 'И2'))
