from classes import Apparatus


class KL(Apparatus):
    '''Класс для описания промежуточного реле'''
    model = 'Промежуточное реле RXM4AB1BD'
    trans = (('a1', 'A1'),
             ('a2', 'A2'),
             ('n1', '11'),
             ('nc1', '12'),
             ('no1', '14'),
             ('n2', '21'),
             ('nc2', '22'),
             ('no2', '24'),
             ('n3', '31'),
             ('nc3', '32'),
             ('no3', '34'),
             ('n4', '41'),
             ('nc4', '42'),
             ('no4', '44'))

class REU11(Apparatus):
    '''Класс для описания указательного реле РЭУ-11-11-5-40'''
    model = 'Реле указательное РЭУ-11-11-5-40 У3'
    trans = (('k1', '1'),
             ('k2', '2'),
             ('no', '3'),
             ('no_', '5'),
             ('nc', '4'),
             ('nc_', '6'))

class REU11_50mA_DC(REU11):
    '''Класс для описания указательного реле РЭУ-11-11-5-40'''
    model = 'Реле указательное РЭУ-11-11-5-40 У3 0.05A DC'

class REU11_24V_DC(REU11):
    '''Класс для описания указательного реле РЭУ-11-11-5-40'''
    model = 'Реле указательное РЭУ-11-11-5-40 У3 24В DC'
